package com.kotlinmvvm.core.data.result

/**
 * @author 浩楠
 * @date 2026/7/21 17:58
 *      _              _           _     _   ____  _             _ _
 *     / \   _ __   __| |_ __ ___ (_) __| | / ___|| |_ _   _  __| (_) ___
 *    / _ \ | '_ \ / _` | '__/ _ \| |/ _` | \___ \| __| | | |/ _` | |/ _ \
 *   / ___ \| | | | (_| | | | (_) | | (_| |  ___) | |_| |_| | (_| | | (_) |
 *  /_/   \_\_| |_|\__,_|_|  \___/|_|\__,_| |____/ \__|\__,_|\__,_|_|\___/
 * 描述: 通用数据成功结果，只携带已经通过业务边界校验的有效值
 */
data class DataSuccess<Value : Any>(val value: Value) : DataResult<Value, Nothing>
