package com.kotlinmvvm.core.data.result

/**
 * @author 浩楠
 * @date 2026/7/21 17:58
 *      _              _           _     _   ____  _             _ _
 *     / \   _ __   __| |_ __ ___ (_) __| | / ___|| |_ _   _  __| (_) ___
 *    / _ \ | '_ \ / _` | '__/ _ \| |/ _` | \___ \| __| | | |/ _` | |/ _ \
 *   / ___ \| | | | (_| | | | (_) | | (_| |  ___) | |_| |_| | (_| | | (_) |
 *  /_/   \_\_| |_|\__,_|_|  \___/|_|\__,_| |____/ \__|\__,_|\__,_|_|\___/
 * 描述: 通用数据失败结果，只携带所属业务域定义的稳定错误值
 */
data class DataFailure<Error : Any>(val error: Error) : DataResult<Nothing, Error>
